<template>
  <div class="analysis">
    <div id="line1"></div>
    <div id="line2"></div>
  </div>
</template>
<script>
import { Chart } from "@antv/g2";
export default {
  name: "analysis",
  methods: {
    initLine1() {
      const data = [
        {
          size: 10,
          cost: [
            2931, 3258, 2983, 2608, 2847, 2749, 3115, 2732, 3082, 3285, 3032,
          ],
          type: "不含模版，超出隐藏",
        },
        {
          size: 20,
          cost: [
            3031, 3333, 3001, 2788, 2924, 3308, 3395, 3009, 3228, 3383, 2938,
          ],
          type: "不含模版，超出隐藏",
        },
        {
          size: 30,
          cost: [
            3319, 3019, 2923, 3269, 3351, 2969, 3041, 3441, 3366, 3019, 3175,
          ],
          type: "不含模版，超出隐藏",
        },
        {
          size: 50,
          cost: [
            3888, 3358, 3551, 3313, 3604, 3101, 3291, 3384, 3380, 3415, 3087,
          ],
          type: "不含模版，超出隐藏",
        },
        {
          size: 70,
          cost: [
            4009, 4315, 4154, 4339, 4255, 4281, 4549, 3949, 4556, 4396, 4533,
          ],
          type: "不含模版，超出隐藏",
        },
        {
          size: 90,
          cost: [
            5015, 4026, 4248, 4455, 4444, 4026, 4226, 4290, 4098, 4066, 4362,
          ],
          type: "不含模版，超出隐藏",
        },
        {
          size: 10,
          cost: [
            4073, 3987, 4095, 4081, 4156, 4238, 4120, 4127, 4478, 4317, 4064,
          ],
          type: "不含模版，超出展示",
        },
        {
          size: 20,
          cost: [
            3934, 3772, 3894, 4168, 3979, 3748, 3914, 4651, 3811, 3917, 4340,
          ],
          type: "不含模版，超出展示",
        },
        {
          size: 30,
          cost: [
            3835, 3971, 4184, 4314, 4128, 4273, 3927, 4048, 3842, 4340, 4154,
          ],
          type: "不含模版，超出展示",
        },
        {
          size: 50,
          cost: [
            4214, 4237, 4086, 4069, 4199, 4421, 4186, 4194, 4156, 4009, 4368,
          ],
          type: "不含模版，超出展示",
        },
        {
          size: 70,
          cost: [
            4202, 4076, 3708, 4201, 4421, 4163, 4072, 4588, 4403, 4149, 4173,
          ],
          type: "不含模版，超出展示",
        },
        {
          size: 90,
          cost: [
            4126, 4230, 4038, 4350, 4488, 4209, 4469, 4236, 4354, 4100, 4506,
          ],
          type: "不含模版，超出展示",
        },
        {
          size: 10,
          cost: [
            11370, 11473, 11092, 11411, 11048, 13500, 11263, 11508, 13719,
            12131,
          ],
          type: "含有模版，超出隐藏",
        },
        {
          size: 20,
          cost: [
            12009, 12433, 12081, 14033, 11780, 12128, 11771, 12777, 12768,
            12910,
          ],
          type: "含有模版，超出隐藏",
        },
        {
          size: 30,
          cost: [
            12155, 13607, 13010, 13175, 13520, 12576, 13960, 13076, 11517,
            12279,
          ],
          type: "含有模版，超出隐藏",
        },
        {
          size: 50,
          cost: [
            14716, 12464, 11693, 12030, 14079, 11575, 11679, 12477, 13808,
            13351,
          ],
          type: "含有模版，超出隐藏",
        },
        {
          size: 70,
          cost: [
            11562, 11955, 11489, 11825, 11648, 12266, 12915, 12703, 12750,
            11374,
          ],
          type: "含有模版，超出隐藏",
        },
        {
          size: 90,
          cost: [
            12832, 11659, 11462, 11488, 11586, 11470, 11640, 11878, 13525,
            12290,
          ],
          type: "含有模版，超出隐藏",
        },
        {
          size: 10,
          cost: [
            11337, 12374, 11989, 11434, 11466, 11405, 11424, 11674, 12034,
            11341,
          ],
          type: "含有模版，超出展示",
        },
        {
          size: 20,
          cost: [
            12780, 12082, 11501, 11311, 11729, 11425, 12132, 11523, 11381,
            11411,
          ],
          type: "含有模版，超出展示",
        },
        {
          size: 30,
          cost: [
            12155, 13607, 13010, 13175, 13520, 12576, 13960, 13076, 11517,
            12279,
          ],
          type: "含有模版，超出展示",
        },
        {
          size: 50,
          cost: [
            12052, 11507, 12889, 11353, 11500, 11370, 11378, 11912, 11263,
            12120,
          ],
          type: "含有模版，超出展示",
        },
        {
          size: 70,
          cost: [
            12065, 12425, 12008, 11325, 11327, 11341, 11868, 12228, 12577,
            11665,
          ],
          type: "含有模版，超出展示",
        },
        {
          size: 90,
          cost: [
            11594, 11876, 11352, 11166, 11837, 11334, 11594, 12223, 12118,
            13107,
          ],
          type: "含有模版，超出展示",
        },
        {
          size: 10,
          cost: [
            12048, 11666, 12008, 11417, 11808, 12013, 11774, 11935, 12531,
            12492,
          ],
          type: "含有模版，不含子表",
        },

        {
          size: 20,
          cost: [
            11810, 11422, 11322, 11373, 11407, 11575, 11505, 11257, 12621,
            13473,
          ],
          type: "含有模版，不含子表",
        },
        {
          size: 30,
          cost: [11993, 12079, 11902, 11760, 11407, 12404, 11795, 11820, 12133],
        },
        {
          size: 50,
          cost: [
            11628, 12283, 12297, 13660, 11551, 11713, 12970, 12868, 12266,
            14423,
          ],
          type: "含有模版，不含子表",
        },
        {
          size: 70,
          cost: [
            12483, 11589, 11455, 11805, 11550, 11774, 11813, 11560, 12557,
            13596,
          ],
          type: "含有模版，不含子表",
        },
        {
          size: 90,
          cost: [
            11934, 12504, 12301, 11916, 12179, 12434, 12967, 13963, 12620,
            11895,
          ],
          type: "含有模版，不含子表",
        },
      ].map((elem) => {
        return {
          size: elem.size,
          cost: elem.cost.reduce((pre, cur) => pre + cur) / 10,
          type: elem.type,
        };
      });
      const chart = new Chart({
        container: "line1",
        height: 400,
        autoFit: true,
        padding: [80, 80],
      });
      chart.data(data);
      chart.scale({
        size: [0, 100],
        cost: {
          nice: true,
        },
      });
      chart.axis("size", {
        title: {
          text: "单次处理的数据量",
        },
      });
      chart.axis("cost", {
        line: {
          lineWidth: 2,
        },
        title: {
          text: "耗时（ms）",
        },
      });
      chart.line().position("size*cost").color("type").shape("smooth");
      chart.point().position("size*cost").color("type").shape("circle");
      chart.render();
    },
    initLine2() {
      const data = [
        {
          size: 10,
          cost: [9643, 9517, 9149, 9134, 9709],
          type: "组织机构",
        },
        {
          size: 20,
          cost: [9296, 9479, 9680, 9372, 9087],
          type: "组织机构",
        },
        {
          size: 30,
          cost: [9198, 8800, 9556, 9216, 9457],
          type: "组织机构",
        },
        {
          size: 50,
          cost: [9911, 9486, 9684, 9373, 9979],
          type: "组织机构",
        },
        {
          size: 70,
          cost: [9423, 8722, 9075, 9036, 9243],
          type: "组织机构",
        },
        {
          size: 90,
          cost: [8921, 9119, 8697, 8711, 9433],
          type: "组织机构",
        },

        {
          size: 10,
          cost: [9260, 8969, 9342, 9317, 9759],
          type: "图片附件",
        },
        {
          size: 20,
          cost: [9269, 9299, 9052, 9382, 9608],
          type: "图片附件",
        },
        {
          size: 30,
          cost: [9408, 8510, 8711, 9567, 9040],
          type: "图片附件",
        },
        {
          size: 50,
          cost: [9952, 9208, 9132, 9378, 9144],
          type: "图片附件",
        },
        {
          size: 70,
          cost: [9416, 9480, 9343, 9488, 9555],
          type: "图片附件",
        },
        {
          size: 90,
          cost: [9038, 8940, 9286, 9385, 8940],
          type: "图片附件",
        },

        {
          size: 10,
          cost: [2352, 2059, 2386, 2149, 2011],
          type: "文字地址",
        },
        {
          size: 20,
          cost: [2407, 1909, 2179, 2053, 2135],
          type: "文字地址",
        },
        {
          size: 30,
          cost: [2573, 2120, 2187, 2397, 2011],
          type: "文字地址",
        },
        {
          size: 50,
          cost: [2647, 2194, 2226, 2268, 2576],
          type: "文字地址",
        },
        {
          size: 70,
          cost: [2103, 2281, 2404, 2098, 2648],
          type: "文字地址",
        },
        {
          size: 90,
          cost: [2374, 2052, 2248, 2552, 2520],
          type: "文字地址",
        },
      ].map((elem) => {
        return {
          size: elem.size,
          type: elem.type,
          cost: elem.cost.reduce((pre, cur) => pre + cur) / 10,
        };
      });
      const chart = new Chart({
        container: "line1",
        height: 400,
        autoFit: true,
        padding: [80, 80],
      });
      chart.data(data);
      chart.scale({
        size: [0, 100],
        cost: {
          nice: true,
        },
      });
      chart.axis("size", {
        title: {
          text: "单次处理的数据量",
        },
      });
      chart.axis("cost", {
        line: {
          lineWidth: 2,
        },
        title: {
          text: "耗时（ms）",
        },
      });
      chart.line().position("size*cost").color("type").shape("smooth");
      chart.point().position("size*cost").color("type").shape("circle");
      chart.render();
    },
  },
  mounted() {
    this.initLine1();
    this.initLine2();
  },
};
</script>